app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `enabled`, `login_name`, `password`, `phone_number`, `updated_at`, `user_name`) VALUES ('2013-06-08 06:53:33', 0, '', '', '', '2013-06-08 06:53:33', '')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `users` SET `login_name` = 'asdf', `user_name` = 'asdf', `password` = 'asdf', `enabled` = 1, `phone_number` = 'asdfasd', `updated_at` = '2013-06-08 06:56:09' WHERE `users`.`id` = 1